Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.FixedViewPlacing Property
 Defines whether the view placing is fixed (true) or free (false).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool FixedViewPlacing { get; set; }
Public Property FixedViewPlacing As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace